[
  {
    "title": "Badminton",
    "logo": "/icons/badminton_icon.png",
    "backgroundImage": "/images/sports/badminton_bg.jpg",
    "extra_data": {
      "category": "Racquet Sport",
      "type": "Indoor/Outdoor",
      "popularity": "Moderate",
      "fun_fact": "The fastest recorded badminton smash was 493 km/h (306 mph) by Lee Chong Wei in 2009, making it one of the fastest racquet sports in the world.",
      "summary": "Badminton is a fast-paced racquet sport that requires agility, precision, and strategic thinking. Played either in singles or doubles, the game involves hitting a shuttlecock over a net using lightweight racquets, with the goal of landing it in the opponent's court while preventing a return. Unlike other racquet sports, badminton is unique in its reliance on a shuttlecock, which is aerodynamically designed to slow down mid-air, leading to rapid exchanges and quick reflex-based rallies. It is popular worldwide, particularly in Asia and Europe, and is an Olympic sport known for its intense speed and endurance demands. Whether played recreationally or professionally, badminton offers an excellent cardiovascular workout while enhancing hand-eye coordination and reaction time."
    }
  },
  {
    "title": "Baseball",
    "logo": "/icons/baseball_icon.png",
    "backgroundImage": "/images/sports/baseball_bg.webp",
    "extra_data": {
      "category": "Team Sport",
      "type": "Outdoor",
      "popularity": "High",
      "fun_fact": "Baseball is often referred to as \"America's pastime,\" but it has a rich history in countries like Japan, Cuba, and the Dominican Republic, where it is also immensely popular.",
      "summary": "Baseball is a bat-and-ball sport that combines strategy, skill, and teamwork. Played between two teams of nine players, the game consists of innings where one team bats while the other fields, aiming to score runs by hitting the ball and running around four bases. Pitchers use a variety of throws to outsmart batters, while fielders work to catch, throw, and tag out runners. Known as \"America’s pastime,\" baseball has a deep-rooted history in the United States but is also widely popular in countries like Japan, the Dominican Republic, and South Korea. With its mix of power, precision, and endurance, baseball requires both individual excellence and seamless coordination, making it an exciting sport for players and fans alike."
    }
  },
  {
    "title": "Basketball",
    "logo": "/icons/basketball_icon.png",
    "backgroundImage": "/images/sports/basketball_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Indoor/Outdoor",
      "popularity": "Very High",
      "fun_fact": "The first basketball game was played in 1891 with a soccer ball and two peach baskets as goals, leading to the sport's evolution into the fast-paced game we know today.",
      "summary": "Basketball is a dynamic, high-intensity sport that combines speed, skill, and teamwork. Played between two teams of five players, the objective is to score points by shooting the ball into the opponent's hoop while defending your own. With constant movement, fast breaks, and strategic plays, basketball demands agility, endurance, and sharp decision-making. The game is played on a rectangular court, where players dribble, pass, and shoot while maneuvering around defenders. Originating in 1891, basketball has grown into a global phenomenon, with the NBA being the most prestigious professional league. Whether played on city streets or in professional arenas, basketball is a thrilling sport that fosters athleticism, coordination, and competitive spirit."
    }
  },
  {
    "title": "Boxing",
    "logo": "/icons/boxing_icon.png",
    "backgroundImage": "/images/sports/boxing_bg.jpg",
    "extra_data": {
      "category": "Combat Sport",
      "type": "Indoor",
      "popularity": "High",
      "fun_fact": "Boxing has ancient origins, with evidence of similar combat sports dating back to the Sumerians in 3000 BC. The modern sport was formalized in the 19th century with the introduction of the Marquess of Queensberry rules.",
      "summary": "Boxing is a combat sport that tests strength, strategy, and endurance, as two opponents face off in a ring, aiming to land punches while avoiding their opponent’s strikes. Fighters compete in timed rounds, using footwork, head movement, and defensive techniques to outmaneuver their adversary. Victory can be achieved through knockout (KO), technical knockout (TKO), or by accumulating more points based on clean, effective punches. Boxing demands intense physical conditioning, mental toughness, and discipline, making it one of the most physically demanding sports. With a rich history dating back to ancient civilizations, boxing remains a globally popular sport, producing legendary fighters and thrilling matches that captivate audiences worldwide."
    }
  },
  {
    "title": "Cheerleading",
    "logo": "/icons/cheerleading_icon.png",
    "backgroundImage": "/images/sports/cheerleading_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Indoor/Outdoor",
      "popularity": "Growing",
      "fun_fact": "Cheerleading was originally an all-male activity when it started in the 1880s — now it's one of the most female-dominated and physically demanding sports in the U.S.",
      "summary": "Cheerleading is a dynamic team sport that blends athleticism, dance, acrobatics, and spirit. Whether on the sidelines or performing competitive routines, cheerleaders must master stunts, tumbling, and synchronized choreography. It requires strength, flexibility, coordination, and trust in teammates. From school spirit to national competitions, cheerleading cultivates leadership, resilience, and teamwork. Coaches and athletes alike rely on specialized gear including cheer shoes, practice wear, bows, and safety mats — all essential for peak performance and safety."
    }
  },
  {
    "title": "Cricket",
    "logo": "/icons/cricket_icon.png",
    "backgroundImage": "/images/sports/cricket_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Outdoor",
      "popularity": "High",
      "fun_fact": "Cricket is one of the oldest team sports, with origins tracing back to 16th-century England. The first recorded match took place in 1646, and the sport has since evolved into a global phenomenon.",
      "summary": "Cricket is a bat-and-ball sport that emphasizes strategy, endurance, and teamwork. Played between two teams of 11 players, the game revolves around one team batting to score runs while the other bowls and fields to restrict scoring and take wickets. Matches can range from fast-paced T20 games to multi-day Test matches, offering different formats for players and fans. The sport is especially popular in countries like India, England, Australia, and Pakistan, with international tournaments like the ICC Cricket World Cup drawing massive audiences. Cricket requires a blend of skill, patience, and tactical decision-making, making it one of the most complex yet captivating sports in the world."
    }
  },
  {
    "title": "Cycling",
    "logo": "/icons/cycling_icon.png",
    "backgroundImage": "/images/sports/cycling_bg.jpg",
    "extra_data": {
      "category": "Individual Sport",
      "type": "Outdoor",
      "popularity": "High",
      "fun_fact": "The longest tandem bicycle ever built was over 20 meters (67 feet) long and could seat 35 people, showcasing the creative side of cycling enthusiasts.",
      "summary": "Cycling emerged in the 19th century with the invention of the bicycle. It quickly grew into a competitive sport and recreational activity, highlighted by events like the Tour de France."
    }
  },
  {
    "title": "E-Sports",
    "logo": "/icons/esports_icon.png",
    "backgroundImage": "/images/sports/esports_bg.jpg",
    "extra_data": {
      "category": "Competitive Gaming",
      "type": "Indoor/Online",
      "popularity": "Very High",
      "fun_fact": "The first known e-sports tournament took place in 1972 at Stanford University, featuring the game 'Spacewar!' and offering a prize of a year's subscription to Rolling Stone magazine.",
      "summary": "E-sports originated from early computer competitions in the 1970s and 80s, evolving into a global phenomenon with professional leagues and international tournaments across various game genres."
    }
  },
  {
    "title": "Football",
    "logo": "/icons/football_icon.png",
    "backgroundImage": "/images/sports/football_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Outdoor",
      "popularity": "Very High",
      "summary": "Football, or soccer, developed in 19th-century England from various regional games. Its simplicity and universal appeal have made it the world's most popular sport."
    }
  },
  {
    "title": "Golf",
    "logo": "/icons/golf_icon.png",
    "backgroundImage": "/images/sports/golf_bg.jpg",
    "extra_data": {
      "category": "Individual Sport",
      "type": "Outdoor",
      "popularity": "Moderate",
      "summary": "Golf originated in Scotland during the 15th century, evolving from simple stick-and-ball games. It is known for its iconic courses and prestigious tournaments such as The Open Championship."
    }
  },
  {
    "title": "Ice Hockey",
    "logo": "/icons/hockey_icon.png",
    "backgroundImage": "/images/sports/ice_hockey_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Indoor/Outdoor",
      "popularity": "High",
      "summary": "Hockey's history spans ancient stick-and-ball games, with modern field and ice hockey emerging in the 19th century. Both forms have grown into globally competitive sports."
    }
  },
  {
    "title": "Ice Skating",
    "logo": "/icons/ice_skating_icon.png",
    "backgroundImage": "/images/sports/ice_skating_bg.webp",
    "extra_data": {
      "category": "Winter Sport",
      "type": "Indoor",
      "popularity": "Moderate",
      "summary": "Ice skating began as a practical mode of winter transportation and evolved into a popular recreational activity and competitive sport, particularly in figure skating and speed skating."
    }
  },
  {
    "title": "MMA",
    "logo": "/icons/mma_icon.png",
    "backgroundImage": "/images/sports/mma_bg.jpg",
    "extra_data": {
      "category": "Combat Sport",
      "type": "Indoor",
      "popularity": "Very High",
      "summary": "Mixed Martial Arts (MMA) draws from various traditional combat sports. Its modern form emerged in the late 20th century, combining techniques from boxing, wrestling, and martial arts into a highly competitive sport."
    }
  },
  {
    "title": "Pickleball",
    "logo": "/icons/pickleball_icon.png",
    "backgroundImage": "/images/sports/pickleball_bg.jpg",
    "extra_data": {
      "category": "Racquet Sport",
      "type": "Indoor/Outdoor",
      "popularity": "Very High",
      "fun_fact":"The name “Pickleball” didn’t come from pickles — it came from the family dog, Pickles, who kept running off with the ball.",
      "summary": "Pickleball is a fast-growing paddle sport that combines elements of tennis, badminton, and ping-pong. Played on a smaller court with a perforated plastic ball and solid paddles, it is easy to learn but offers plenty of competitive depth. The game can be played in singles or doubles, with the objective of hitting the ball over a net and into the opponent’s court without committing faults. Due to its smaller court size and slower ball speed compared to tennis, pickleball is accessible to players of all ages and skill levels. Its popularity has surged in recent years, especially in the U.S., as a fun and social sport that provides both cardio exercise and strategic gameplay."
    }
  },
  {
    "title": "Rugby",
    "logo": "/icons/rugby_icon.png",
    "backgroundImage": "/images/sports/rugby_bg.webp",
    "extra_data": {
      "category": "Team Sport",
      "type": "Outdoor",
      "popularity": "Moderate",
      "summary": "Rugby originated in 19th-century England when a football player picked up the ball during a match. It has since evolved into a physically demanding sport with passionate followings worldwide."
    }
  },
  {
    "title": "Running",
    "logo": "/icons/running_icon.png",
    "backgroundImage": "/images/sports/running_bg.webp",
    "extra_data": {
      "category": "Individual Sport",
      "type": "Outdoor",
      "popularity": "High",
      "summary": "Running is one of humanity's oldest activities, rooted in survival and competition. It has evolved into both a recreational pursuit and a competitive sport with events ranging from sprints to marathons."
    }
  },
  {
    "title": "Skateboarding",
    "logo": "/icons/skateboarding_icon.png",
    "backgroundImage": "/images/sports/skateboarding_bg.jpg",
    "extra_data": {
      "category": "Extreme Sport",
      "type": "Outdoor",
      "popularity": "High",
      "summary": "Skateboarding emerged in the 1950s in California as an alternative to surfing during flat weather. It has grown into a creative, urban sport with a vibrant counterculture and international competitions."
    }
  },
  {
    "title": "Skiing",
    "logo": "/icons/skiing_icon.png",
    "backgroundImage": "/images/sports/skiing_bg.jpg",
    "extra_data": {
      "category": "Individual Sport",
      "type": "Outdoor",
      "popularity": "Moderate",
      "summary": "Skiing originated as a means of transportation in snowy regions thousands of years ago. It evolved into a popular recreational and competitive sport, featured prominently in the Winter Olympics."
    }
  },
  {
    "title": "Snowboarding",
    "logo": "/icons/snowboarding_icon.png",
    "backgroundImage": "/images/sports/snowboarding_bg.jpg",
    "extra_data": {
      "category": "Winter Sport",
      "type": "Outdoor",
      "popularity": "Moderate",
      "summary": "Snowboarding was developed in the 1960s and 70s as a hybrid of skiing, surfing, and skateboarding. It gained mainstream popularity in the 1990s and is now a staple winter sport."
    }
  },
  {
    "title": "Soccer",
    "logo": "/icons/soccer_icon.png",
    "backgroundImage": "/images/sports/soccer_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Outdoor",
      "popularity": "Very High",
      "summary": "Soccer, or football, has ancient origins but was codified in 19th-century England. Its universal appeal and simplicity have made it the most popular sport in the world."
    }
  },
  {
    "title": "Surfing",
    "logo": "/icons/surfing_icon.png",
    "backgroundImage": "/images/sports/surfing_bg.jpg",
    "extra_data": {
      "category": "Water Sport",
      "type": "Outdoor",
      "popularity": "Moderate",
      "summary": "Surfing originated in ancient Polynesian culture as both a recreational activity and a spiritual practice. It has evolved into a competitive sport celebrated for its connection to nature and a free-spirited lifestyle."
    }
  },
  {
    "title": "Swimming",
    "logo": "/icons/swimming_icon.png",
    "backgroundImage": "/images/sports/swimming_bg.webp",
    "extra_data": {
      "category": "Individual Sport",
      "type": "Indoor/Outdoor",
      "popularity": "High",
      "summary": "Swimming has been a vital skill for survival and recreation since ancient times. It evolved into a competitive sport with standardized events featured in the modern Olympic Games."
    }
  },
  {
    "title": "Tennis",
    "logo": "/icons/tennis_icon.png",
    "backgroundImage": "/images/sports/tennis_bg.webp",
    "extra_data": {
      "category": "Racquet Sport",
      "type": "Outdoor",
      "popularity": "High",
      "summary": "Tennis began in 12th-century France as a handball game before evolving into a racket sport in the 19th century. Its prestigious tournaments and athletic elegance have made it a global favorite."
    }
  },
  {
    "title": "Volleyball",
    "logo": "/icons/volleyball_icon.png",
    "backgroundImage": "/images/sports/volleyball_bg.jpg",
    "extra_data": {
      "category": "Team Sport",
      "type": "Indoor/Outdoor",
      "popularity": "High",
      "summary": "Volleyball was invented in 1895 by William G. Morgan in the United States as a less intense alternative to basketball. It has grown into a fast-paced, dynamic sport enjoyed worldwide."
    }
  },
  {
    "title": "Weight Training",
    "logo": "/icons/weight_training_icon.png",
    "backgroundImage": "/images/sports/weight_training_bg.jpg",
    "extra_data": {
      "category": "Strength & Conditioning",
      "type": "Indoor",
      "popularity": "High",
      "summary": "Weight training is a foundational form of strength exercise that uses resistance from weights, machines, or bodyweight to build muscle, improve endurance, and enhance overall fitness. It's suitable for all levels—from beginners to competitive athletes."
    }
  },
  {
    "title": "Wrestling",
    "logo": "/icons/wrestling_icon.png",
    "backgroundImage": "/images/sports/wrestling_bg.webp",
    "extra_data": {
      "category": "Combat Sport",
      "type": "Indoor",
      "popularity": "High",
      "summary": "Wrestling is one of the oldest sports in history, with roots in ancient civilizations. It has evolved into various styles and remains a core element of modern combat sports and the Olympic Games."
    }
  },
  {
    "title": "Yoga",
    "logo": "/icons/yoga_icon.png",
    "backgroundImage": "/images/sports/yoga_bg.jpg",
    "extra_data": {
      "category": "Mind & Body",
      "type": "Indoor/Outdoor",
      "popularity": "Very High",
      "summary": "Yoga originated in ancient India as a spiritual and physical practice aimed at achieving balance and inner peace. Over time, it has evolved into a globally embraced discipline promoting health and well-being."
    }
  }
]
